
USE schooltv_main;

SET FOREIGN_KEY_CHECKS=0;

REPLACE INTO `publisher` (`id`, `name`, `short_name`, `created_at`, `created_by`, `updated_at`, `updated_by`, `deleted_at`, `deleted_by`) VALUES
(1, '光村図書出版株式会社', '光村', '2016-01-06 04:25:41', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(2, '東京書籍株式会社', '東書', '2016-01-06 04:25:41', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(3, '教育出版株式会社', '教出', '2016-01-06 04:25:41', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(4, '株式会社三省堂', '三省', '2016-01-06 04:25:41', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(5, '学校図書株式会社', '学図', '2016-01-06 04:25:41', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(6, '光村図書出版株式会社', '光村', '2016-01-06 04:25:41', 'system', '2016-01-05 21:25:41', 'system', NULL, NULL),
(7, '開隆堂出版株式会社', '開隆', '2016-01-06 04:25:41', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(8, '株式会社新興出版社啓林館', '啓林', '2016-01-06 04:25:41', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(9, '数研出版株式会社', '数研', '2016-01-06 04:25:41', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(10, '大日本図書株式会社', '大日本', '2016-01-06 04:25:41', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(11, '日本文教出版株式会社', '※日文', '2016-01-06 04:25:41', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(12, '日本文教出版株式会社（旧大阪書籍）', '日文', '2016-01-06 04:25:41', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(13, '社団法人信州教育会出版社', '信教', '2016-02-15 05:23:15', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(14, '株式会社帝国書院', '帝国', '2016-02-15 05:23:15', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(15, '株式会社育鵬社', '育鵬社', '2016-02-15 05:23:15', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(16, '株式会社自由社', '自由社', '2016-02-15 05:23:15', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL),
(17, '株式会社清水書院', '清水', '2016-02-15 05:23:15', 'system', '2016-02-14 22:23:15', 'system', NULL, NULL);

SET FOREIGN_KEY_CHECKS=1;